app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    if current_user
      @notices = Notice.all

INSERT INTO "notices" ("title", "discription", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Student created notice"], ["discription", "student made this notices"], ["user_id", 7], ["created_at", "2022-08-18 21:39:29.192521"], ["updated_at", "2022-08-18 21:39:29.192521"]]
---
  def create
    if current_user
      @notice = Notice.new(notice_params)
      @notice.user_id = current_user.id

      if @notice.save

UPDATE "notices" SET "title" = ?, "discription" = ?, "updated_at" = ? WHERE "notices"."id" = ?  [["title", "teacher updated created notice"], ["discription", "teacher update made this notices"], ["updated_at", "2022-08-19 13:01:57.275490"], ["id", 6]]
---
  def update
    if @notice.update(notice_params)

DELETE FROM "notices" WHERE "notices"."id" = ?  [["id", 9]]
---
  def destroy
    @notice.destroy

SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_notice
    @notice = Notice.find(params[:id])