app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."role1" != ?  [["role1", 1]]
---
  def index
    if current_user
      @users = User.where.not(role1: 1) if user_student
      @users = User.where(role1: 1) if user_teacher
      @users = User.all if user_admin
      @users1 = User.where(role1: 0) if user_teacher

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "teacher61updated@gmail.com"], ["updated_at", "2022-08-19 16:17:18.295985"], ["id", 21]]
---
  def update
    if @user.update(user_params)